Terraform plan for __staging__
<details>
<summary>Plan: 29 to add, 1 to change, 2 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # cloudfoundry_service_instance.solrcloud_broker_k8s_cluster will be destroyed
  # (because cloudfoundry_service_instance.solrcloud_broker_k8s_cluster is not in configuration)
  - resource "cloudfoundry_service_instance" "solrcloud_broker_k8s_cluster" {
      - id                             = "0de2abbf-26e6-452b-8a3b-923c4b884df2" -> null
      - name                           = "ssb-solrcloud-k8s" -> null
      - recursive_delete               = false -> null
      - replace_on_params_change       = false -> null
      - replace_on_service_plan_change = false -> null
      - service_plan                   = "75ff550a-1f72-4bc2-9bd9-644a174a3384" -> null
      - space                          = "5edc803e-3376-4788-b72c-a152f11925b0" -> null
      - tags                           = [
          - "k8s",
        ] -> null

      - timeouts {
          - create = "60m" -> null
          - delete = "40m" -> null
          - update = "90m" -> null
        }
    }

  # cloudfoundry_user_provided_service.ssb-solrcloud-k8s will be created
  + resource "cloudfoundry_user_provided_service" "ssb-solrcloud-k8s" {
      + credentials_json = (sensitive value)
      + id               = (known after apply)
      + name             = "ssb-solrcloud-k8s"
      + space            = "5edc803e-3376-4788-b72c-a152f11925b0"
    }

  # module.broker_solrcloud.cloudfoundry_app.ssb will be updated in-place
  ~ resource "cloudfoundry_app" "ssb" {
        id                         = "2919ff62-98a0-4779-8d77-f4368f8659bd"
      ~ id_bg                      = "************************************" -> (known after apply)
        name                       = "ssb-solrcloud"
      ~ source_code_hash           = "L5X7otaivMCKDfhOaWCgyLxOT6UGpGWGgUWjAQ/iq18=" -> "kcLMLIIJJmQpY4MkEgxJHTA0HU4dU2qC7wJJClvE0hE="
        # (18 unchanged attributes hidden)


      ~ service_binding {
          ~ service_instance = "0de2abbf-26e6-452b-8a3b-923c4b884df2" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
        # (2 unchanged blocks hidden)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "k8s-d6e0b7fc580c3a4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      + id    = (known after apply)
      + name  = "k8s-d6e0b7fc580c3a4d"
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.bind.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.bind.kubernetes_role_binding.binding will be created
  + resource "kubernetes_role_binding" "binding" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "Role"
          + name      = "namespace-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = (known after apply)
          + namespace = "default"
        }
    }

  # module.brokerpak-eks-terraform.module.bind.kubernetes_service_account.account will be created
  + resource "kubernetes_service_account" "account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.bind.random_id.name will be created
  + resource "random_id" "name" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_eks_cluster.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "main"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "k8s-d6e0b7fc580c3a4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_eks_cluster_auth.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "main"  {
      + id    = (known after apply)
      + name  = "k8s-d6e0b7fc580c3a4d"
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.data.aws_lb.ingress_nlb will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lb" "ingress_nlb"  {
      + access_logs                = (known after apply)
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + customer_owned_ipv4_pool   = (known after apply)
      + desync_mitigation_mode     = (known after apply)
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = (known after apply)
      + enable_deletion_protection = (known after apply)
      + enable_http2               = (known after apply)
      + enable_waf_fail_open       = (known after apply)
      + id                         = (known after apply)
      + idle_timeout               = (known after apply)
      + internal                   = (known after apply)
      + ip_address_type            = (known after apply)
      + load_balancer_type         = (known after apply)
      + name                       = "solrcloud-k8s"
      + security_groups            = (known after apply)
      + subnet_mapping             = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.kubernetes_secret.secret will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_secret" "secret"  {
      + data      = (sensitive value)
      + id        = (known after apply)
      + immutable = (known after apply)
      + type      = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = (known after apply)
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.data.kubernetes_service.ingress_service will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "ingress_service"  {
      + id     = (known after apply)
      + spec   = (known after apply)
      + status = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "ingress-nginx-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.data.template_file.admin_kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "admin_kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.aws_route53_record.nlb will be created
  + resource "aws_route53_record" "nlb" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "solrcloud-k8s.ssb-staging.data.gov"
      + type            = "A"
      + zone_id         = "*********************"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + atomic                     = true
      + chart                      = "external-dns"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "external-dns"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/external-dns"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                env:
                  - name: AWS_DEFAULT_REGION
                    value: us-west-2
                extraArgs:
                  - --zone-id-filter=Z07256311URVY5CP2DBVK
                  - --fqdn-template={{.Name}}.solrcloud-k8s.ssb-staging.data.gov
            EOT,
        ]
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "logLevel"
          + value = "info"
        }
      + set {
          + name  = "policy"
          + value = "sync"
        }
      + set {
          + name  = "provider"
          + value = "aws"
        }
      + set {
          + name  = "rbac.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "external-dns"
        }
      + set {
          + name  = "sources"
          + value = "{ingress}"
        }
      + set {
          + name  = "txtPrefix"
          + value = "edns-"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.ingress_nginx will be created
  + resource "helm_release" "ingress_nginx" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = true
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "ingress-nginx"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 600
      + values                     = [
          + <<-EOT
                controller: 
                  image: 
                    allowPrivilegeEscalation: false
            EOT,
        ]
      + verify                     = false
      + version                    = "4.0.17"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "aws_iam_role_arn"
          + value = (known after apply)
        }
      + set {
          + name  = "clusterName"
          + value = "k8s-d6e0b7fc580c3a4d"
        }
      + set {
          + name  = "controller.autoscaling.enabled"
          + value = "true"
        }
      + set {
          + name  = "controller.autoscaling.maxReplicas"
          + value = "1"
        }
      + set {
          + name  = "controller.autoscaling.minReplicas"
          + value = "1"
        }
      + set {
          + name  = "controller.config.compute-full-forwarded-for"
          + value = "true"
        }
      + set {
          + name  = "controller.config.server-tokens"
          + value = "false"
        }
      + set {
          + name  = "controller.config.use-forwarded-headers"
          + value = "true"
        }
      + set {
          + name  = "controller.config.use-proxy-protocol"
          + value = "true"
        }
      + set {
          + name  = "controller.extraArgs.publish-status-address"
          + value = "solrcloud-k8s.ssb-staging.data.gov"
        }
      + set {
          + name  = "controller.ingressClassResource.default"
          + value = "true"
        }
      + set {
          + name  = "controller.metrics.enabled"
          + value = "true"
        }
      + set {
          + name  = "controller.publishService.enabled"
          + value = "false"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-backend-protocol"
          + value = "ssl"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-name"
          + value = "solrcloud-k8s"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-nlb-target-type"
          + value = "ip"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-proxy-protocol"
          + value = "*"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-scheme"
          + value = "internet-facing"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-cert"
          + value = "arn:aws:acm:us-west-2:054110281448:certificate/0fe388a2-369d-4f31-bc56-4e42ee7329f4"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-negotiation-policy"
          + value = "ELBSecurityPolicy-TLS-1-2-2017-01"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-ssl-ports"
          + value = "https"
        }
      + set {
          + name  = "controller.service.annotations.service\\.beta\\.kubernetes\\.io/aws-load-balancer-type"
          + value = "external"
        }
      + set {
          + name  = "controller.service.externalTrafficPolicy"
          + value = "Local"
        }
      + set {
          + name  = "controller.service.type"
          + value = "LoadBalancer"
        }
      + set {
          + name  = "rbac.create"
          + value = "true"
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "true"
        }
      + set {
          + name  = "vpcId"
          + value = "vpc-0bcc0130a52d137d9"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.solr-operator will be created
  + resource "helm_release" "solr-operator" {
      + atomic                     = false
      + chart                      = "solr-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "solr"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://solr.apache.org/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.5.0"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "zookeeper-operator.install"
          + value = "false"
        }
      + set {
          + name  = "zookeeper-operator.use"
          + value = "true"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.helm_release.zookeeper-operator will be created
  + resource "helm_release" "zookeeper-operator" {
      + atomic                     = false
      + chart                      = "zookeeper-operator"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "zookeeper"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.pravega.io/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "0.2.12"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "hooks.delete"
          + value = "false"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role.external_dns will be created
  + resource "kubernetes_cluster_role" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "services",
              + "pods",
              + "nodes",
              + "endpoints",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "extensions",
              + "networking.k8s.io",
            ]
          + resources  = [
              + "ingresses",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "networking.istio.io",
            ]
          + resources  = [
              + "gateways",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role_binding.admin will be created
  + resource "kubernetes_cluster_role_binding" "admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "admin-c327ebb43b24b66e-cluster-role-binding"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "admin-c327ebb43b24b66e"
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_cluster_role_binding.external_dns will be created
  + resource "kubernetes_cluster_role_binding" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "external-dns"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "external-dns"
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_config_map.logging will be created
  + resource "kubernetes_config_map" "logging" {
      + data = {
          + "output.conf" = <<-EOT
                [OUTPUT]
                  Name cloudwatch_logs
                  Match   *
                  region us-west-2
                  log_group_name fluent-bit-cloudwatch-k8s-d6e0b7fc580c3a4d
                  log_stream_prefix from-fluent-bit-
                  auto_create_group true
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-logging"
          + namespace        = "aws-observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_namespace.logging will be created
  + resource "kubernetes_namespace" "logging" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "aws-observability" = "enabled"
            }
          + name             = "aws-observability"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_role.namespace_admin will be created
  + resource "kubernetes_role" "namespace_admin" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "namespace-admin"
          + namespace        = "default"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "*",
            ]
          + resources  = [
              + "*",
            ]
          + verbs      = [
              + "*",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_service_account.admin will be created
  + resource "kubernetes_service_account" "admin" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "admin-c327ebb43b24b66e"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_service_account.external_dns will be created
  + resource "kubernetes_service_account" "external_dns" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "eks.amazonaws.com/role-arn" = "arn:aws:iam::054110281448:role/k8s-d6e0b7fc580c3a4d-external-dns"
            }
          + generation       = (known after apply)
          + name             = "external-dns"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.kubernetes_storage_class.ebs-sc will be created
  + resource "kubernetes_storage_class" "ebs-sc" {
      + allow_volume_expansion = true
      + id                     = (known after apply)
      + parameters             = {
          + "encrypted" = "true"
          + "kmsKeyId"  = "3b4cd100-31fa-435f-919a-89bf3e127c63"
        }
      + reclaim_policy         = "Delete"
      + storage_provisioner    = "kubernetes.io/aws-ebs"
      + volume_binding_mode    = "Immediate"

      + metadata {
          + generation       = (known after apply)
          + name             = "ebs-sc"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.local_file.kubeconfig[0] will be created
  + resource "local_file" "kubeconfig" {
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "kubeconfig-k8s-d6e0b7fc580c3a4d"
      + id                   = (known after apply)
      + sensitive_content    = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.null_resource.cluster-functional will be created
  + resource "null_resource" "cluster-functional" {
      + id = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.null_resource.prerequisite_binaries_present is tainted, so must be replaced
-/+ resource "null_resource" "prerequisite_binaries_present" {
      ~ id = "*******************" -> (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.time_sleep.alb_controller_destroy_delay will be created
  + resource "time_sleep" "alb_controller_destroy_delay" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_caller_identity.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_caller_identity" "current"  {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster" "selected"  {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "k8s-d6e0b7fc580c3a4d"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_eks_cluster_auth.selected[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_eks_cluster_auth" "selected"  {
      + id    = (known after apply)
      + name  = "k8s-d6e0b7fc580c3a4d"
      + token = (sensitive value)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_iam_policy_document.eks_oidc_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "eks_oidc_assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:aws-load-balancer-controller",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_region.current will be read during apply
  # (config refers to values not yet known)
 <= data "aws_region" "current"  {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = "us-west-2"
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.aws_vpc.selected will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "selected"  {
      + arn                     = (known after apply)
      + cidr_block              = (known after apply)
      + cidr_block_associations = (known after apply)
      + default                 = (known after apply)
      + dhcp_options_id         = (known after apply)
      + enable_dns_hostnames    = (known after apply)
      + enable_dns_support      = (known after apply)
      + id                      = (known after apply)
      + instance_tenancy        = (known after apply)
      + ipv6_association_id     = (known after apply)
      + ipv6_cidr_block         = (known after apply)
      + main_route_table_id     = (known after apply)
      + owner_id                = (known after apply)
      + state                   = (known after apply)
      + tags                    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.data.template_file.kubeconfig will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "kubeconfig"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = (sensitive)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_policy.this will be created
  + resource "aws_iam_policy" "this" {
      + arn         = (known after apply)
      + description = "Permissions that are required to manage AWS Application Load Balancers."
      + id          = (known after apply)
      + name        = "k8s-k8s-d6e0b7fc580c3a4d-alb-management"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + iam:AWSServiceName = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                          + StringEquals = {
                              + ec2:CreateAction = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:RequestTag/elbv2.k8s.aws/cluster  = "true"
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + aws:ResourceTag/elbv2.k8s.aws/cluster = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Permissions required by the Kubernetes AWS Load Balancer controller to do its job."
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        }
      + tags_all              = {
          + "domain" = "solrcloud-k8s.ssb-staging.data.gov"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "k8s-k8s-d6e0b7fc580c3a4d-aws-load-balancer-controller"
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.helm_release.alb_controller will be created
  + resource "helm_release" "alb_controller" {
      + atomic                     = true
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 900
      + verify                     = false
      + version                    = "1.3.3"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "k8s-d6e0b7fc580c3a4d"
        }
      + set {
          + name  = "hostNetwork"
          + value = "false"
        }
      + set {
          + name  = "region"
          + value = "us-west-2"
        }
      + set {
          + name  = "serviceAccount.create"
          + value = "false"
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller"
        }
      + set {
          + name  = "vpcId"
          + value = (known after apply)
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_cluster_role.this will be created
  + resource "kubernetes_cluster_role" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
              + "extensions",
            ]
          + resources  = [
              + "configmaps",
              + "endpoints",
              + "events",
              + "ingresses",
              + "ingresses/status",
              + "services",
            ]
          + verbs      = [
              + "create",
              + "get",
              + "list",
              + "update",
              + "watch",
              + "patch",
            ]
        }
      + rule {
          + api_groups = [
              + "",
              + "extensions",
            ]
          + resources  = [
              + "nodes",
              + "pods",
              + "secrets",
              + "services",
              + "namespaces",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_cluster_role_binding.this will be created
  + resource "kubernetes_cluster_role_binding" "this" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "aws-load-balancer-controller"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "aws-load-balancer-controller"
          + namespace = "kube-system"
        }
    }

  # module.brokerpak-eks-terraform.module.provision.module.aws_load_balancer_controller.kubernetes_service_account.this will be created
  + resource "kubernetes_service_account" "this" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = {
              + "app.kubernetes.io/component"  = "controller"
              + "app.kubernetes.io/managed-by" = "terraform"
              + "app.kubernetes.io/name"       = "aws-load-balancer-controller"
            }
          + name             = "aws-load-balancer-controller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 29 to add, 1 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [plan #198](https://github.com/GSA/datagov-ssb/actions/runs/1929344657)